src/DataProcessors/РабочееМестоКанбанУчетПрессформ/РабочееМестоКанбанУчетПрессформ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКанбанУчетПрессформ</name>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПЗ</name>
    <attributes>
      <name>Потребитель</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственноеЗадание</name>
      <type>
        <types>DocumentRef.ПроизводственноеЗадание</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЛОПотребителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаСкладеГП</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Остановлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/РабочееМестоКанбанУчетПрессформ/Forms/ФормаОборудование/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ПроизводственноеЗадание.Прессформы.Количество() > 0 Тогда
		Для каждого ТЧ Из Параметры.ПроизводственноеЗадание.Прессформы Цикл
		ТЧ_О = ТаблицаОборудование.Добавить();
		ТЧ_О.Станок = ТЧ.Станок;
		ТЧ_О.Прессформа = ТЧ.Прессформа;
		ТЧ_О.Количество = ТЧ.Количество;
		КонецЦикла;
	Иначе                                                           
	СписокТО = Новый СписокЗначений;

	ПолучитьТехОснастку(СписокТО,ПолучитьИзделие(),ПолучитьКоличество());
	ТЧ_О = ТаблицаОборудование.Добавить();
	ТЧ_О.Количество = Параметры.ПроизводственноеЗадание.Количество;	
		Если СписокТО.Количество() = 1 Тогда
		ТЧ_О.Прессформа = СписокТО[0].Значение;	
		КонецЕсли;	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ЗаполнитьПЗ()
	Попытка
	ПЗОбъект = Параметры.ПроизводственноеЗадание.ПолучитьОбъект();
	ПЗОбъект.Прессформы.Очистить();
		Для каждого ТЧ Из ТаблицаОборудование Цикл
		ТЧ_П = ПЗОбъект.Прессформы.Добавить();
		ТЧ_П.Станок = ТЧ.Станок;
		ТЧ_П.Прессформа = ТЧ.Прессформа;
		ТЧ_П.Количество = ТЧ.Количество;
		КонецЦикла;
	ПЗОбъект.Записать();
	Исключение
	Сообщить(ОписаниеОшибки());
	Возврат(Неопределено);
	КонецПопытки;
Возврат(СокрЛП(ПЗОбъект.Прессформы[0].Станок.Наименование)+"-"+СокрЛП(ПЗОбъект.Прессформы[0].Прессформа.Наименование));
КонецФункции

&НаСервере
Функция ПроверитьТаблицу()
	Для каждого ТЧ Из ТаблицаОборудование Цикл
		Если Не ЗначениеЗаполнено(ТЧ.Станок) Тогда
		Сообщить("Не выбран станок!");
		Возврат(Ложь);
		КонецЕсли;
			Если Не ЗначениеЗаполнено(ТЧ.Прессформа) Тогда
			Сообщить("Не выбрана прессформа!");
			Возврат(Ложь);
			КонецЕсли;
				Если ТЧ.Количество = 0 Тогда
				Сообщить("Не указано кол-во!");
				Возврат(Ложь);
				КонецЕсли;
	КонецЦикла; 
Возврат(?(ТаблицаОборудование.Итог("Количество") = Параметры.ПроизводственноеЗадание.Количество,Истина,Ложь));
КонецФункции 

&НаКлиенте
Процедура КнопкаОК(Команда)
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Если ПроверитьТаблицу() Тогда
		Результат = ЗаполнитьПЗ();
			Если Результат <> Неопределено Тогда
			ЭтаФорма.Закрыть(Исполнитель);
			КонецЕсли;
		Иначе
		Сообщить("Общее количество в таблице не совпадает с количеством в ПЗ!");
		КонецЕсли;
	Иначе
	Сообщить("Исполнитель не выбран!");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОтмена(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
          
&НаСервере
Процедура ПолучитьТехОснастку(СписокТО,ЭтапСпецификации,КолУзла)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н_ТОсн(ЭтапСпецификации,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ТипЗнч(ВыборкаНР.Элемент) = Тип("СправочникСсылка.ТехОснастка") Тогда
		СписокТО.Добавить(ВыборкаНР.Элемент);
		ТаблицаАналогов = ОбщегоНазначенияПовтИсп.ПолучитьАналогиНормРасходов(ВыборкаНР.Ссылка,ТекущаяДата(),Истина);
			Для каждого ТЧ_ТА Из ТаблицаАналогов Цикл
			СписокТО.Добавить(ТЧ_ТА.Элемент,"(А) "+СокрЛП(ТЧ_ТА.Элемент.Наименование));
			КонецЦикла;							
		Иначе
			Если ВыборкаНР.Элемент.Канбан.Пустая() Тогда
			ПолучитьТехОснастку(СписокТО,ВыборкаНР.Элемент,ПолучитьБазовоеКоличество(ВыборкаНР.Норма,ВыборкаНР.Элемент.ОсновнаяЕдиницаИзмерения)*КолУзла);
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  
    
&НаСервере
Функция ПолучитьИзделие()
Возврат(ЭтаФорма.Параметры.ПроизводственноеЗадание.Изделие);
КонецФункции 

&НаСервере
Функция ПолучитьКоличество()
Возврат(ЭтаФорма.Параметры.ПроизводственноеЗадание.Количество);
КонецФункции

&НаКлиенте
Процедура ТаблицаОборудованиеПрессформаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
СписокТО = Новый СписокЗначений;

ПолучитьТехОснастку(СписокТО,ПолучитьИзделие(),ПолучитьКоличество());
	Если СписокТО.Количество() > 0 Тогда
	ТО = Неопределено;
	ТО = СписокТО.ВыбратьЭлемент("Выберите прессформу",ТО);
		Если ТО <> Неопределено Тогда
        Элементы.ТаблицаОборудование.ТекущиеДанные.Прессформа = ТО.Значение;
		КонецЕсли;
	Иначе
	Сообщить("Прессформы не найдены в спецификации. Обратитесь к технологу!");
	КонецЕсли; 	
КонецПроцедуры
